SetOverwrite
Syntax
SapObject.SapModel.DesignConcrete.SP63_13330_2012.SetOverwrite
VB6 Procedure
Function SetOverwrite(ByVal Name As String, ByVal Item As Long, ByVal Value As Double, Optional ByVal ItemType as eItemType = Object) As Long
Parameters
Name
The name of an existing frame object or group depending on the value of the ItemType item.
Item
This is an integer between 1 and 14, inclusive, indicating the overwrite item considered.
1 = Framing type
2 = Live load reduction factor
3 = Unbraced length ratio, Major
4 = Unbraced length ratio, Minor
5 = Effective length factor, K Major
6 = Effective length factor, K Minor
7 = Moment amplification factor, Eta Major
8 = Moment amplification factor, Eta Minor
9 = Gammab3 for column
10 = Gammab3 for beam
11 = Consider torsion?
12 = (qsw,1*Z1)/(Rs*As,1)
13 = Corner rebar fraction top
14 = Corner rebar fraction bottom
Value
The value of the considered overwrite item.
1 = Framing type
0 = Program Determined
1 = Sway
2 = Nonsway
2 = Live load reduction factor
Value >=0; 0 means use program determined value.
3 = Unbraced length ratio, Major
Value >=0; 0 means use program determined value.
4 = Unbraced length ratio, Minor
Value >=0; 0 means use program determined value.
5 = Effective length factor, K Major
Value >=0; 0 means use program determined value.
6 = Effective length factor, K Minor
Value >=0; 0 means use program determined value.
7 = Moment amplification factor, Eta Major
Value >=0; 0 means use program determined value.
8 = Moment amplification factor, Eta Minor
Value >=0; 0 means use program determined value.
9 = Gammab3 for column
Value >=0; 0 means use program determined value.
10 = Gammab3 for beam
Value >=0; 0 means use program determined value.
11 = Consider torsion?
0 = Program Determined
1 = No
2 = Yes
12 = (qsw,1*Z1)/(Rs*As,1)
0.5 <= Value <= 1.5; 0 means use program determined value.
13 = Corner rebar fraction top
0 < Value <= 1; 0 means use program determined value.
14 = Corner rebar fraction bottom
0 < Value <= 1; 0 means use program determined value.
ItemType
This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
If this item is Object, the assignment is made to the frame object specified by the Name item.
If this item is Group, the assignment is made to all frame objects in the group specified by the Name item.
If this item is SelectedObjects, assignment is made to all selected frame objects, and the Name item is ignored.
Remarks
This function sets the value of a concrete design overwrite item.
The function returns zero if the item is successfully set, otherwise it returns a nonzero value.
VBA Example
Sub SetConcreteDesignOverwriteItemSP63_13330_2012()
 'dimension variables
 Dim SapObject as cOAPI
 Dim SapModel As cSapModel
 Dim ret As Long
 'create Sap2000 object
 Set SapObject = CreateObject("CSI.SAP2000.API.SapObject")
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'create new concrete frame section property
 ret = SapModel.PropFrame.SetRectangle("R1", "4000Psi", 20, 12)'create model from template
 ret = SapModel.File.New2DFrame(PortalFrame, 2, 144, 2, 288, True, "R1", "R1")
 'set concrete design code
 ret = SapModel.DesignConcrete.SetCode("SP 63.13330.2012")
 'set overwrite item
 ret = SapModel.DesignConcrete.SP63_13330_2012.SetOverwrite("8", 1, 2)
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in v20.1.0.
See Also
GetOverwrite